<template>
	<view class="content">
	一、本协议的服务内容
		
		1.1 “魏牌官网”是长城汽车股份有限公司徐水魏牌销售分公司向您提供查看车辆信息、预约试驾、查找经销商/服务商等功能的网站。您可以通过“魏牌官网”查看车辆信息、预约试驾、查找经销商/服务商等，包含但不限于如下：
		
		(1)车辆信息：您可以在“车型”中选择想要查看的车辆，并进入车型页查看信息；
		
		(2)预约试驾：您可以在“预约试驾”中进行填写车型、姓名、电话、省份市区、选择相应门店进行预约试驾服务；
		
		经销商查询：您可以通过“经销商查询”查找各地经销商并获取地理位置与电话信息
		
	二、用户须知
		
		2.1您在使用我们的服务时填写、登录、使用的账号名称、头像、个人简介等账号信息资料应遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不得在账号信息资料中出现违法和不良信息，不得冒用、关联机构或社会名人或采取其他足以让人引起混淆的方式注册账号。且您保证在填写、登录、使用账号信息资料时，不得有以下情形：
		
		(1)反对宪法所确定的基本原则的；
		
		(2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
		
		(3)损害国家荣誉和利益的；
		
		(4)歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；
		
		(5)宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；
		
		(6)煽动民族仇恨、民族歧视，破坏民族团结的；
		
		(7)破坏国家宗教政策或违反国家宗教相关法律法规，宣扬邪教和封建迷信的；
		
		(8)散布谣言，扰乱经济序和社会秩序的；
		
		(9)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
		
		(10)侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；
		
		(11)含有法律、行政法规禁止的其他内容的。
		
		2.2若您在注册和使用我们的产品或服务时，存在任何违反法律法规或不符合本条款规定的行为，我们有权不予注册；已经注册的，我们有权不通知您而单方采取限期改正、短期封禁、永久封禁、注销、等措施，并有权向政府主管部门进行报告。
		
	三、第三方的产品及服务
		
		您在我们的产品上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的协议。您在选择使用第三方产品或服务前应充分了解第三方产品或服务的功能、用户协议及隐私保护政策，我们会充分审查第三方的资质，要求其保证所提供的产品/服务合法合规，并保护您的个人信息安全。
		
	四、隐私的有关说明
		
		我们非常重视您的个人信息的保护，特此通过单独明示的《隐私政策》明确向您告知我们处理您个人信息的目的、方式和范围，查阅、更正信息的途径以及拒绝提供信息的后果。您在使用我们提供的服务前，请您完整阅读《隐私政策》，以帮助您更好地保护您的隐私权。
		
	五、不可抗力及免责
		
		您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务受到影响。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于罢工，暴乱，火灾，洪水，风暴，爆炸，战争而造成的不能服务或延迟服务承担责任等。出现上述情况时，我们将努力在第一时间与相关单位配合，争取及时进行处理，但是由此给您造成的损失，我们在法律允许的范围内免责。
		
	六、违约责任
		
		您理解并同意：若我们发现或收到他人举报您违反法律法规、本协议平台使用规则的，我们有权根据相应情形采取以下一项或多项措施（具体措施以及采取措施的时间长短由我们根据您的违法、违约情节相应情况确定）：对您进行警告，对相关内容进行删除、屏蔽，限制、暂停、终止您使用我们账号及服务，限制、暂停、终止您使用部分或全部本服务，向相关主管机关报告并提交您的使用记录和其他信息，追究法律责任等措施。
		
	七、服务中止或终止
		
		7.1由您终止
		您可通过您可以通过“联系我们”所列的联系方式与我们取得联系，我们将积极响应您的请求来终止使用登录状态下的相关服务。
		
		
		7.2由我们中止或终止
		7.2.1鉴于互联网服务的特殊性，我们有权对服务内容进行变更，也可能会中断、中止或终止全部或者任一部分的服务，包括免费服务或收费服务，并通过官网公示或系统弹窗的形式通知您。
		
		7.2.2您了解并同意，我们可能定期或不定期地对提供服务的平台设备、设施和软硬件进行维护或检修，如因此类情况而造成收费服务在合理时间内中止，但会事先在官网以公示或系统弹窗的形式通告您。
		
		7.2.3我们可能依照适用法律在任何时候临时性或永久性中止、取消或限制您访问全部或部分服务。我们会在采取前述行动前通知您。但若出现如下情形，我们可能在不事先通知您的情况下永久性或临时性限制、取消或终止您访问全部或部分服务：
		
		(1) 您或代表您行使权利的任何人进行欺诈或违法活动，或向我们提供虚假或误导信息；
		
		(2)您使用收费网络服务时未按规定支付相应服务费；
		
		(3)根据法律规定您应提交真实信息，如果您注册账号时提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；
		
		(4)依照有效法律程序响应执法部门或政府机关提出的要求；
		
		(5)为执行紧急的系统或硬件维护或更新工作；
		
		(6)因无法预料的技术、安全或业务原因。
		
		7.2.4您对本服务的使用或访问一旦被我们中止、终止或注销，没有我们的事先书面许可，您将无法再创建本平台账号或访问本服务。
		
		7.2.5本协议到期或终止不影响本协议中明确说明在其失效或终止后仍可操作或继续有效的条件，也不影响任何权益或义务或任何应在本协议失效或终止后继续有效的权利或义务。
		
		在本协议终止或到期后继续有效的其它任何条款在您与我们之间的契约关系终止或到期后继续有效。
		
	八、 通知及送达
		
		8.1通知
		8.1.1 您同意我们通过以下合理的方式向您送达各类通知：
		
		(1)公示的文案；
		
		(2)站内消息、弹出消息、客户端推送的消息；
		
		(3)根据您预留的联系方式发出的电子邮件、手机短信、函件等。
		
		8.1.2您在注册成为本平台用户，并接受本平台服务时，您应该向我们提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。如因您未及时更新联系方式使得我们无法与您取得联系，从而导致您遭受任何损失或增加任何费用等不利后果的，应由您自行承担。
		
		8.1.3您在注册本平台用户时生成的用于登陆本平台接收站内信、系统消息的账号（包括子账号），也作为您的有效联系方式。
		
		8.1.4 我们将通过您上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。
		
		8.1.5 我们可在必要时向您发出与服务有关的消息（例如：系统维护、安全警告、消费记录、法律文书），您无法取消这些与服务有关、性质不属于商业推广的重要通知。
		
		
		8.2送达
		8.2.1 我们通过上述联系方式向您发出通知，其中以电子方式发出的书面通知，包括但不限于公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送站内信息、系统消息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址邮递，按邮戳记录的时间视为送达。
		
		8.2.2 对于在我们产品或服务上因交易活动引起的任何纠纷，您同意我们、司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向您送达投诉文件、法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱账号等联系方式为您在我们平台注册、更新时提供的手机号码、电子邮箱联系方式，我们、司法机关向上述联系方式发出投诉文件、法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。
		
		8.2.3您同意司法机关可采取以上一种或多种符合诉讼法规定的送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。
		
		8.2.4您应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。
		
	九、争议解决
		
		9.1 本协议的成立、生效、履行、解释、修订、终止、执行与纠纷解决，适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例或行业惯例。
		
		9.2 若您和我们之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，双方同意按照法律规定选择有管辖权的人民法院诉讼解决。
		
		9.3 本协议某一条款无论因何种原因无效或不可执行，该条款应视为可分的且并不影响其余条款的有效性及可执行性，对双方具有约束力。
		
		9.4 若本协议有中文、英文等多个语言版本，相应内容不一致的，均以中文版的内容为准。
	</view>
</template>

<script>
</script>

<style lang="less" scoped>
	.content {
		padding: 14rpx 14rpx 60rpx;
		font-size: 28rpx;
		line-height: 42rpx;
		// 保留空白符，但是正常地进行换行
		white-space: pre-wrap;
		word-wrap: break-word;
		word-break: break-all;
	}
</style>